Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/1.0.64/edc/PIC32MZ1064DAB288.PIC
<?xml version="1.0" encoding="UTF-8" standalone="no"?><edc:PIC xmlns:edc="http://crownking/edc" xmlns:ltx="http://crownking/ltx" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" edc:arch="32xxxx" edc:clonedfrom="PIC32MZ2064DAB288" edc:desc="" edc:dosid="02275" edc:dsid="60001361" edc:informedby="DOS PS DS" edc:isextended="false" edc:masksetid="WACB" edc:name="PIC32MZ1064DAB288" edc:procid="0x03A3" edc:psid="60001145" xsi:schemaLocation="http://crownking/edc edc/PIC.xsd">
  <edc:Properties>
    <edc:Property edc:propkey="file.registers.are.odd.address.accessible" edc:propvalue="true"/>
  </edc:Properties>
  <edc:Import/>
  <edc:Power>
    <edc:VPP edc:defaultvoltage="3.300" edc:maxvoltage="3.600" edc:minvoltage="2.500"/>
    <edc:VDD edc:maxdefaultvoltage="3.600" edc:maxvoltage="3.600" edc:mindefaultvoltage="2.500" edc:minvoltage="2.500" edc:nominalvoltage="3.300"/>
  </edc:Power>
  <edc:Programming edc:erasepagesize="4096" edc:haschecksum="true" edc:haslvp="false" edc:haslvp2="true" edc:pagesize="4096">
    <edc:ProgrammingWaitTime edc:progop="erase" edc:time="20" edc:timeunits="ms"/>
    <edc:ProgrammingWaitTime edc:progop="pgm" edc:time="20" edc:timeunits="us"/>
    <edc:ProgrammingWaitTime edc:progop="cfg" edc:time="20" edc:timeunits="us"/>
    <edc:ProgrammingRowSize edc:nzsize="512" edc:progop="pgm"/>
    <edc:ProgrammingRowSize edc:nzsize="128" edc:progop="cfg"/>
    <edc:Wait edc:cfg="20" edc:erase="20" edc:pgm="20"/>
    <edc:Latches edc:cfg="128" edc:pgm="512"/>
  </edc:Programming>
  <edc:ArchDef edc:desc="32xxxx" edc:name="32xxxx">
    <edc:MemTraits edc:addrinc="0x4" edc:locsize="0x4" edc:wordimpl="0xffffffff" edc:wordinit="0xffffffff" edc:wordsafe="0xffffffff" edc:wordsize="0x4"/>
  </edc:ArchDef>
  <edc:InstructionSet>
    <edc:InstructionSet edc:instructionsetid="mips32r2"/>
    <edc:InstructionSet edc:instructionsetid="micromips"/>
    <edc:InstructionSet edc:instructionsetid="dspr2"/>
  </edc:InstructionSet>
  <edc:L1Cache/>
  <edc:WatchdogTimer edc:min="1"/>
  <edc:InterruptList edc:hasvariableoffsets="true" edc:interruptcontrollerflavor="int_evic_v3" edc:shadowsetcount="8">
    <edc:Interrupt edc:cname="CORE_TIMER" edc:desc="Core Timer" edc:irq="0"/>
    <edc:Interrupt edc:cname="CORE_SOFTWARE_0" edc:desc="Core Software 0" edc:irq="1"/>
    <edc:Interrupt edc:cname="CORE_SOFTWARE_1" edc:desc="Core Software 1" edc:irq="2"/>
    <edc:Interrupt edc:cname="EXTERNAL_0" edc:desc="Ext INT 0" edc:irq="3"/>
    <edc:Interrupt edc:cname="TIMER_1" edc:desc="Timer1" edc:irq="4"/>
    <edc:Interrupt edc:cname="INPUT_CAPTURE_1_ERROR" edc:desc="Input Capture 1 Error" edc:irq="5"/>
    <edc:Interrupt edc:cname="INPUT_CAPTURE_1" edc:desc="Input Capture 1" edc:irq="6"/>
    <edc:Interrupt edc:cname="OUTPUT_COMPARE_1" edc:desc="Output Compare 1" edc:irq="7"/>
    <edc:Interrupt edc:cname="EXTERNAL_1" edc:desc="Ext INT 1" edc:irq="8"/>
    <edc:Interrupt edc:cname="TIMER_2" edc:desc="Timer2" edc:irq="9"/>
    <edc:Interrupt edc:cname="INPUT_CAPTURE_2_ERROR" edc:desc="Input Capture 2 Error" edc:irq="10"/>
    <edc:Interrupt edc:cname="INPUT_CAPTURE_2" edc:desc="Input Capture 2" edc:irq="11"/>
    <edc:Interrupt edc:cname="OUTPUT_COMPARE_2" edc:desc="Output Compare 2" edc:irq="12"/>
    <edc:Interrupt edc:cname="EXTERNAL_2" edc:desc="Ext INT 2" edc:irq="13"/>
    <edc:Interrupt edc:cname="TIMER_3" edc:desc="Timer3" edc:irq="14"/>
    <edc:Interrupt edc:cname="INPUT_CAPTURE_3_ERROR" edc:desc="Input Capture 3 Error" edc:irq="15"/>
    <edc:Interrupt edc:cname="INPUT_CAPTURE_3" edc:desc="Input Capture 3" edc:irq="16"/>
    <edc:Interrupt edc:cname="OUTPUT_COMPARE_3" edc:desc="Output Compare 3" edc:irq="17"/>
    <edc:Interrupt edc:cname="EXTERNAL_3" edc:desc="Ext INT 3" edc:irq="18"/>
    <edc:Interrupt edc:cname="TIMER_4" edc:desc="Timer4" edc:irq="19"/>
    <edc:Interrupt edc:cname="INPUT_CAPTURE_4_ERROR" edc:desc="Input Capture 4 Error" edc:irq="20"/>
    <edc:Interrupt edc:cname="INPUT_CAPTURE_4" edc:desc="Input Capture 4" edc:irq="21"/>
    <edc:Interrupt edc:cname="OUTPUT_COMPARE_4" edc:desc="Output Compare 4" edc:irq="22"/>
    <edc:Interrupt edc:cname="EXTERNAL_4" edc:desc="Ext INT 4" edc:irq="23"/>
    <edc:Interrupt edc:cname="TIMER_5" edc:desc="Timer5" edc:irq="24"/>
    <edc:Interrupt edc:cname="INPUT_CAPTURE_5_ERROR" edc:desc="Input Capture 5 Error" edc:irq="25"/>
    <edc:Interrupt edc:cname="INPUT_CAPTURE_5" edc:desc="Input Capture 5" edc:irq="26"/>
    <edc:Interrupt edc:cname="OUTPUT_COMPARE_5" edc:desc="Output Compare 5" edc:irq="27"/>
    <edc:Interrupt edc:cname="TIMER_6" edc:desc="Timer6" edc:irq="28"/>
    <edc:Interrupt edc:cname="INPUT_CAPTURE_6_ERROR" edc:desc="Input Capture 6 Error" edc:irq="29"/>
    <edc:Interrupt edc:cname="INPUT_CAPTURE_6" edc:desc="Input Capture 6" edc:irq="30"/>
    <edc:Interrupt edc:cname="OUTPUT_COMPARE_6" edc:desc="Output Compare 6" edc:irq="31"/>
    <edc:Interrupt edc:cname="TIMER_7" edc:desc="Timer7" edc:irq="32"/>
    <edc:Interrupt edc:cname="INPUT_CAPTURE_7_ERROR" edc:desc="Input Capture 7 Error" edc:irq="33"/>
    <edc:Interrupt edc:cname="INPUT_CAPTURE_7" edc:desc="Input Capture 7" edc:irq="34"/>
    <edc:Interrupt edc:cname="OUTPUT_COMPARE_7" edc:desc="Output Compare 7" edc:irq="35"/>
    <edc:Interrupt edc:cname="TIMER_8" edc:desc="Timer8" edc:irq="36"/>
    <edc:Interrupt edc:cname="INPUT_CAPTURE_8_ERROR" edc:desc="Input Capture 8 Error" edc:irq="37"/>
    <edc:Interrupt edc:cname="INPUT_CAPTURE_8" edc:desc="Input Capture 8" edc:irq="38"/>
    <edc:Interrupt edc:cname="OUTPUT_COMPARE_8" edc:desc="Output Compare 8" edc:irq="39"/>
    <edc:Interrupt edc:cname="TIMER_9" edc:desc="Timer9" edc:irq="40"/>
    <edc:Interrupt edc:cname="INPUT_CAPTURE_9_ERROR" edc:desc="Input Capture 9 Error" edc:irq="41"/>
    <edc:Interrupt edc:cname="INPUT_CAPTURE_9" edc:desc="Input Capture 9" edc:irq="42"/>
    <edc:Interrupt edc:cname="OUTPUT_COMPARE_9" edc:desc="Output Compare 9" edc:irq="43"/>
    <edc:Interrupt edc:cname="ADC" edc:desc="ADC Global " edc:irq="44"/>
    <edc:Interrupt edc:cname="ADC_FIFO" edc:desc="ADC FIFO" edc:irq="45"/>
    <edc:Interrupt edc:cname="ADC_DC1" edc:desc="ADC Digital Comparator 1" edc:irq="46"/>
    <edc:Interrupt edc:cname="ADC_DC2" edc:desc="ADC Digital Comparator 2" edc:irq="47"/>
    <edc:Interrupt edc:cname="ADC_DC3" edc:desc="ADC Digital Comparator 3" edc:irq="48"/>
    <edc:Interrupt edc:cname="ADC_DC4" edc:desc="ADC Digital Comparator 4" edc:irq="49"/>
    <edc:Interrupt edc:cname="ADC_DC5" edc:desc="ADC Digital Comparator 5" edc:irq="50"/>
    <edc:Interrupt edc:cname="ADC_DC6" edc:desc="ADC Digital Comparator 6" edc:irq="51"/>
    <edc:Interrupt edc:cname="ADC_DF1" edc:desc="ADC Digital Filter 1" edc:irq="52"/>
    <edc:Interrupt edc:cname="ADC_DF2" edc:desc="ADC Digital Filter 2" edc:irq="53"/>
    <edc:Interrupt edc:cname="ADC_DF3" edc:desc="ADC Digital Filter 3" edc:irq="54"/>
    <edc:Interrupt edc:cname="ADC_DF4" edc:desc="ADC Digital Filter 4" edc:irq="55"/>
    <edc:Interrupt edc:cname="ADC_DF5" edc:desc="ADC Digital Filter 5" edc:irq="56"/>
    <edc:Interrupt edc:cname="ADC_DF6" edc:desc="ADC Digital Filter 6" edc:irq="57"/>
    <edc:Interrupt edc:cname="ADC_FAULT" edc:desc="ADC Fault" edc:irq="58"/>
    <edc:Interrupt edc:cname="ADC_DATA0" edc:desc="ADC Data 0" edc:irq="59"/>
    <edc:Interrupt edc:cname="ADC_DATA1" edc:desc="ADC Data 1" edc:irq="60"/>
    <edc:Interrupt edc:cname="ADC_DATA2" edc:desc="ADC Data 2" edc:irq="61"/>
    <edc:Interrupt edc:cname="ADC_DATA3" edc:desc="ADC Data 3" edc:irq="62"/>
    <edc:Interrupt edc:cname="ADC_DATA4" edc:desc="ADC Data 4" edc:irq="63"/>
    <edc:Interrupt edc:cname="ADC_DATA5" edc:desc="ADC Data 5" edc:irq="64"/>
    <edc:Interrupt edc:cname="ADC_DATA6" edc:desc="ADC Data 6" edc:irq="65"/>
    <edc:Interrupt edc:cname="ADC_DATA7" edc:desc="ADC Data 7" edc:irq="66"/>
    <edc:Interrupt edc:cname="ADC_DATA8" edc:desc="ADC Data 8" edc:irq="67"/>
    <edc:Interrupt edc:cname="ADC_DATA9" edc:desc="ADC Data 9" edc:irq="68"/>
    <edc:Interrupt edc:cname="ADC_DATA10" edc:desc="ADC Data 10" edc:irq="69"/>
    <edc:Interrupt edc:cname="ADC_DATA11" edc:desc="ADC Data 11" edc:irq="70"/>
    <edc:Interrupt edc:cname="ADC_DATA12" edc:desc="ADC Data 12" edc:irq="71"/>
    <edc:Interrupt edc:cname="ADC_DATA13" edc:desc="ADC Data 13" edc:irq="72"/>
    <edc:Interrupt edc:cname="ADC_DATA14" edc:desc="ADC Data 14" edc:irq="73"/>
    <edc:Interrupt edc:cname="ADC_DATA15" edc:desc="ADC Data 15" edc:irq="74"/>
    <edc:Interrupt edc:cname="ADC_DATA16" edc:desc="ADC Data 16" edc:irq="75"/>
    <edc:Interrupt edc:cname="ADC_DATA17" edc:desc="ADC Data 17" edc:irq="76"/>
    <edc:Interrupt edc:cname="ADC_DATA18" edc:desc="ADC Data 18" edc:irq="77"/>
    <edc:Interrupt edc:cname="ADC_DATA19" edc:desc="ADC Data 19" edc:irq="78"/>
    <edc:Interrupt edc:cname="ADC_DATA20" edc:desc="ADC Data 20" edc:irq="79"/>
    <edc:Interrupt edc:cname="ADC_DATA21" edc:desc="ADC Data 21" edc:irq="80"/>
    <edc:Interrupt edc:cname="ADC_DATA22" edc:desc="ADC Data 22" edc:irq="81"/>
    <edc:Interrupt edc:cname="ADC_DATA23" edc:desc="ADC Data 23" edc:irq="82"/>
    <edc:Interrupt edc:cname="ADC_DATA24" edc:desc="ADC Data 24" edc:irq="83"/>
    <edc:Interrupt edc:cname="ADC_DATA25" edc:desc="ADC Data 25" edc:irq="84"/>
    <edc:Interrupt edc:cname="ADC_DATA26" edc:desc="ADC Data 26" edc:irq="85"/>
    <edc:Interrupt edc:cname="ADC_DATA27" edc:desc="ADC Data 27" edc:irq="86"/>
    <edc:Interrupt edc:cname="ADC_DATA28" edc:desc="ADC Data 28" edc:irq="87"/>
    <edc:Interrupt edc:cname="ADC_DATA29" edc:desc="ADC Data 29" edc:irq="88"/>
    <edc:Interrupt edc:cname="ADC_DATA30" edc:desc="ADC Data 30" edc:irq="89"/>
    <edc:Interrupt edc:cname="ADC_DATA31" edc:desc="ADC Data 31" edc:irq="90"/>
    <edc:Interrupt edc:cname="ADC_DATA32" edc:desc="ADC Data 32" edc:irq="91"/>
    <edc:Interrupt edc:cname="ADC_DATA33" edc:desc="ADC Data 33" edc:irq="92"/>
    <edc:Interrupt edc:cname="ADC_DATA34" edc:desc="ADC Data 34" edc:irq="93"/>
    <edc:Interrupt edc:cname="ADC_DATA35" edc:desc="ADC Data 35" edc:irq="94"/>
    <edc:Interrupt edc:cname="ADC_DATA36" edc:desc="ADC Data 36" edc:irq="95"/>
    <edc:Interrupt edc:cname="ADC_DATA37" edc:desc="ADC Data 37" edc:irq="96"/>
    <edc:Interrupt edc:cname="ADC_DATA38" edc:desc="ADC Data 38" edc:irq="97"/>
    <edc:Interrupt edc:cname="ADC_DATA39" edc:desc="ADC Data 39" edc:irq="98"/>
    <edc:Interrupt edc:cname="ADC_DATA40" edc:desc="ADC Data 40" edc:irq="99"/>
    <edc:Interrupt edc:cname="ADC_DATA41" edc:desc="ADC Data 41" edc:irq="100"/>
    <edc:Interrupt edc:cname="ADC_DATA42" edc:desc="ADC Data 42" edc:irq="101"/>
    <edc:Interrupt edc:cname="ADC_DATA43" edc:desc="ADC Data 43" edc:irq="102"/>
    <edc:Interrupt edc:cname="USB_SR" edc:desc="USB Suspend/Resume" edc:irq="103"/>
    <edc:Interrupt edc:cname="CORE_PERF_COUNT" edc:desc="Core Performance Counter" edc:irq="104"/>
    <edc:Interrupt edc:cname="CORE_FAST_DEBUG_CHAN" edc:desc="Core Fast Debug Channel" edc:irq="105"/>
    <edc:Interrupt edc:cname="SYSTEM_BUS_PROTECTION" edc:desc="System Bus Protection Violation" edc:irq="106"/>
    <edc:Interrupt edc:cname="CRYPTO" edc:desc="Crypto Engine Event" edc:irq="107"/>
    <edc:Interrupt edc:cname="SPI1_FAULT" edc:desc="SPI1 Fault" edc:irq="109"/>
    <edc:Interrupt edc:cname="SPI1_RX" edc:desc="SPI1 Receive Done" edc:irq="110"/>
    <edc:Interrupt edc:cname="SPI1_TX" edc:desc="SPI1 Transmit Done" edc:irq="111"/>
    <edc:Interrupt edc:cname="UART1_FAULT" edc:desc="UART1 Fault" edc:irq="112"/>
    <edc:Interrupt edc:cname="UART1_RX" edc:desc="UART1 Receive Done" edc:irq="113"/>
    <edc:Interrupt edc:cname="UART1_TX" edc:desc="UART1 Transmit Done" edc:irq="114"/>
    <edc:Interrupt edc:cname="I2C1_BUS" edc:desc="I2C1 Bus Collision Event" edc:irq="115"/>
    <edc:Interrupt edc:cname="I2C1_SLAVE" edc:desc="I2C1 Slave Event" edc:irq="116"/>
    <edc:Interrupt edc:cname="I2C1_MASTER" edc:desc="I2C1 Master Event" edc:irq="117"/>
    <edc:Interrupt edc:cname="CHANGE_NOTICE_A" edc:desc="PORTA Input Change" edc:irq="118"/>
    <edc:Interrupt edc:cname="CHANGE_NOTICE_B" edc:desc="PORTB Input Change" edc:irq="119"/>
    <edc:Interrupt edc:cname="CHANGE_NOTICE_C" edc:desc="PORTC Input Change" edc:irq="120"/>
    <edc:Interrupt edc:cname="CHANGE_NOTICE_D" edc:desc="PORTD Input Change" edc:irq="121"/>
    <edc:Interrupt edc:cname="CHANGE_NOTICE_E" edc:desc="PORTE Input Change" edc:irq="122"/>
    <edc:Interrupt edc:cname="CHANGE_NOTICE_F" edc:desc="PORTF Input Change" edc:irq="123"/>
    <edc:Interrupt edc:cname="CHANGE_NOTICE_G" edc:desc="PORTG Input Change" edc:irq="124"/>
    <edc:Interrupt edc:cname="CHANGE_NOTICE_H" edc:desc="PORTH Input Change" edc:irq="125"/>
    <edc:Interrupt edc:cname="CHANGE_NOTICE_J" edc:desc="PORTJ Input Change" edc:irq="126"/>
    <edc:Interrupt edc:cname="CHANGE_NOTICE_K" edc:desc="PORTK Input Change" edc:irq="127"/>
    <edc:Interrupt edc:cname="PMP" edc:desc="Parallel Master Port" edc:irq="128"/>
    <edc:Interrupt edc:cname="PMP_ERROR" edc:desc="Parallel Master Port Error" edc:irq="129"/>
    <edc:Interrupt edc:cname="COMPARATOR_1" edc:desc="Comparator 1" edc:irq="130"/>
    <edc:Interrupt edc:cname="COMPARATOR_2" edc:desc="Comparator 2" edc:irq="131"/>
    <edc:Interrupt edc:cname="USB" edc:desc="USB General Event" edc:irq="132"/>
    <edc:Interrupt edc:cname="USB_DMA" edc:desc="USB DMA Event" edc:irq="133"/>
    <edc:Interrupt edc:cname="DMA0" edc:desc="DMA Channel 0" edc:irq="134"/>
    <edc:Interrupt edc:cname="DMA1" edc:desc="DMA Channel 1" edc:irq="135"/>
    <edc:Interrupt edc:cname="DMA2" edc:desc="DMA Channel 2" edc:irq="136"/>
    <edc:Interrupt edc:cname="DMA3" edc:desc="DMA Channel 3" edc:irq="137"/>
    <edc:Interrupt edc:cname="DMA4" edc:desc="DMA Channel 4" edc:irq="138"/>
    <edc:Interrupt edc:cname="DMA5" edc:desc="DMA Channel 5" edc:irq="139"/>
    <edc:Interrupt edc:cname="DMA6" edc:desc="DMA Channel 6" edc:irq="140"/>
    <edc:Interrupt edc:cname="DMA7" edc:desc="DMA Channel 7" edc:irq="141"/>
    <edc:Interrupt edc:cname="SPI2_FAULT" edc:desc="SPI2 Fault" edc:irq="142"/>
    <edc:Interrupt edc:cname="SPI2_RX" edc:desc="SPI2 Receive Done" edc:irq="143"/>
    <edc:Interrupt edc:cname="SPI2_TX" edc:desc="SPI2 Transmit Done" edc:irq="144"/>
    <edc:Interrupt edc:cname="UART2_FAULT" edc:desc="UART2 Fault" edc:irq="145"/>
    <edc:Interrupt edc:cname="UART2_RX" edc:desc="UART2 Receive Done" edc:irq="146"/>
    <edc:Interrupt edc:cname="UART2_TX" edc:desc="UART2 Transmit Done" edc:irq="147"/>
    <edc:Interrupt edc:cname="I2C2_BUS" edc:desc="I2C2 Bus Collision Event" edc:irq="148"/>
    <edc:Interrupt edc:cname="I2C2_SLAVE" edc:desc="I2C2 Slave Event" edc:irq="149"/>
    <edc:Interrupt edc:cname="I2C2_MASTER" edc:desc="I2C2 Master Event" edc:irq="150"/>
    <edc:Interrupt edc:cname="CAN1" edc:desc="Control Area Network 1" edc:irq="151"/>
    <edc:Interrupt edc:cname="CAN2" edc:desc="Control Area Network 2" edc:irq="152"/>
    <edc:Interrupt edc:cname="ETHERNET" edc:desc="Ethernet" edc:irq="153"/>
    <edc:Interrupt edc:cname="SPI3_FAULT" edc:desc="SPI3 Fault" edc:irq="154"/>
    <edc:Interrupt edc:cname="SPI3_RX" edc:desc="SPI3 Receive Done" edc:irq="155"/>
    <edc:Interrupt edc:cname="SPI3_TX" edc:desc="SPI3 Transmit Done" edc:irq="156"/>
    <edc:Interrupt edc:cname="UART3_FAULT" edc:desc="UART3 Fault" edc:irq="157"/>
    <edc:Interrupt edc:cname="UART3_RX" edc:desc="UART3 Receive Done" edc:irq="158"/>
    <edc:Interrupt edc:cname="UART3_TX" edc:desc="UART3 Transmit Done" edc:irq="159"/>
    <edc:Interrupt edc:cname="I2C3_BUS" edc:desc="I2C3 Bus Collision Event" edc:irq="160"/>
    <edc:Interrupt edc:cname="I2C3_SLAVE" edc:desc="I2C3 Slave Event" edc:irq="161"/>
    <edc:Interrupt edc:cname="I2C3_MASTER" edc:desc="I2C3 Master Event" edc:irq="162"/>
    <edc:Interrupt edc:cname="SPI4_FAULT" edc:desc="SPI4 Fault" edc:irq="163"/>
    <edc:Interrupt edc:cname="SPI4_RX" edc:desc="SPI4 Receive Done" edc:irq="164"/>
    <edc:Interrupt edc:cname="SPI4_TX" edc:desc="SPI4 Transmit Done" edc:irq="165"/>
    <edc:Interrupt edc:cname="RTCC" edc:desc="Real Time Clock" edc:irq="166"/>
    <edc:Interrupt edc:cname="FLASH_CONTROL" edc:desc="Flash Control Event" edc:irq="167"/>
    <edc:Interrupt edc:cname="PREFETCH" edc:desc="Prefetch Module SEC Event" edc:irq="168"/>
    <edc:Interrupt edc:cname="SQI1" edc:desc="SQI1 Event" edc:irq="169"/>
    <edc:Interrupt edc:cname="UART4_FAULT" edc:desc="UART4 Fault" edc:irq="170"/>
    <edc:Interrupt edc:cname="UART4_RX" edc:desc="UART4 Receive Done" edc:irq="171"/>
    <edc:Interrupt edc:cname="UART4_TX" edc:desc="UART4 Transmit Done" edc:irq="172"/>
    <edc:Interrupt edc:cname="I2C4_BUS" edc:desc="I2C4 Bus Collision Event" edc:irq="173"/>
    <edc:Interrupt edc:cname="I2C4_SLAVE" edc:desc="I2C4 Slave Event" edc:irq="174"/>
    <edc:Interrupt edc:cname="I2C4_MASTER" edc:desc="I2C4 Master Event" edc:irq="175"/>
    <edc:Interrupt edc:cname="SPI5_FAULT" edc:desc="SPI5 Fault" edc:irq="176"/>
    <edc:Interrupt edc:cname="SPI5_RX" edc:desc="SPI5 Receive Done" edc:irq="177"/>
    <edc:Interrupt edc:cname="SPI5_TX" edc:desc="SPI5 Transmit Done" edc:irq="178"/>
    <edc:Interrupt edc:cname="UART5_FAULT" edc:desc="UART5 Fault" edc:irq="179"/>
    <edc:Interrupt edc:cname="UART5_RX" edc:desc="UART5 Receive Done" edc:irq="180"/>
    <edc:Interrupt edc:cname="UART5_TX" edc:desc="UART5 Transmit Done" edc:irq="181"/>
    <edc:Interrupt edc:cname="I2C5_BUS" edc:desc="I2C5 Bus Collision Event" edc:irq="182"/>
    <edc:Interrupt edc:cname="I2C5_SLAVE" edc:desc="I2C5 Slave Event" edc:irq="183"/>
    <edc:Interrupt edc:cname="I2C5_MASTER" edc:desc="I2C5 Master Event" edc:irq="184"/>
    <edc:Interrupt edc:cname="SPI6_FAULT" edc:desc="SPI6 Fault" edc:irq="185"/>
    <edc:Interrupt edc:cname="SPI6_RX" edc:desc="SPI6 Receive Done" edc:irq="186"/>
    <edc:Interrupt edc:cname="SPI6_TX" edc:desc="SPI6 Transmit Done" edc:irq="187"/>
    <edc:Interrupt edc:cname="UART6_FAULT" edc:desc="UART6 Fault" edc:irq="188"/>
    <edc:Interrupt edc:cname="UART6_RX" edc:desc="UART6 Receive Done" edc:irq="189"/>
    <edc:Interrupt edc:cname="UART6_TX" edc:desc="UART6 Transmit Done" edc:irq="190"/>
    <edc:Interrupt edc:cname="SDHC" edc:desc="SD Host Controller" edc:irq="191"/>
    <edc:Interrupt edc:cname="GLCD" edc:desc="Grapics LCD Controller" edc:irq="192"/>
    <edc:Interrupt edc:cname="GPU" edc:desc="Graphics Processing Unit" edc:irq="193"/>
    <edc:Interrupt edc:cname="CTMU" edc:desc="Charge Time Measurement Unit" edc:irq="195"/>
    <edc:Interrupt edc:cname="ADC_EOS" edc:desc="ADC End of Scan Ready" edc:irq="196"/>
    <edc:Interrupt edc:cname="ADC_ARDY" edc:desc="ADC Analog Circuits Ready" edc:irq="197"/>
    <edc:Interrupt edc:cname="ADC_URDY" edc:desc="ADC Update Ready" edc:irq="198"/>
    <edc:Interrupt edc:cname="ADC0_EARLY" edc:desc="ADC0 Early Interrupt Request" edc:irq="199"/>
    <edc:Interrupt edc:cname="ADC1_EARLY" edc:desc="ADC1 Early Interrupt Request" edc:irq="200"/>
    <edc:Interrupt edc:cname="ADC2_EARLY" edc:desc="ADC2 Early Interrupt Request" edc:irq="201"/>
    <edc:Interrupt edc:cname="ADC3_EARLY" edc:desc="ADC3 Early Interrupt Request" edc:irq="202"/>
    <edc:Interrupt edc:cname="ADC4_EARLY" edc:desc="ADC4 Early Interrupt Request" edc:irq="203"/>
    <edc:Interrupt edc:cname="ADC_EARLY" edc:desc="ADC Group Early Interrupt Request" edc:irq="205"/>
    <edc:Interrupt edc:cname="ADC7_EARLY" edc:desc="ADC7 Early Interrupt Request" edc:irq="206"/>
    <edc:Interrupt edc:cname="ADC0_WARM" edc:desc="ADC0 Warm Interrupt Request" edc:irq="207"/>
    <edc:Interrupt edc:cname="ADC1_WARM" edc:desc="ADC1 Warm Interrupt Request" edc:irq="208"/>
    <edc:Interrupt edc:cname="ADC2_WARM" edc:desc="ADC2 Warm Interrupt Request" edc:irq="209"/>
    <edc:Interrupt edc:cname="ADC3_WARM" edc:desc="ADC3 Warm Interrupt Request" edc:irq="210"/>
    <edc:Interrupt edc:cname="ADC4_WARM" edc:desc="ADC4 Warm Interrupt Request" edc:irq="211"/>
    <edc:Interrupt edc:cname="ADC7_WARM" edc:desc="ADC7 Warm Interrupt Request" edc:irq="214"/>
    <edc:Interrupt edc:cname="MPLL_FAULT" edc:desc="MPLL Fault" edc:irq="215"/>
  </edc:InterruptList>
  <edc:Breakpoints edc:hasappinout="true" edc:hwbpcount="12"/>
  <edc:ProjectionTable edc:ksegmask="0xFF000000">
    <edc:Projection edc:ksegval="0x7D000000" edc:ptovop="XOR" edc:ptovval="0x60000000" edc:vtopop="XOR" edc:vtopval="0x60000000"/>
    <edc:Projection edc:ksegval="0x80000000" edc:ptovop="XOR" edc:ptovval="0x80000000" edc:vtopop="XOR" edc:vtopval="0x80000000"/>
    <edc:Projection edc:ksegval="0x88000000" edc:ptovop="XOR" edc:ptovval="0x80000000" edc:vtopop="XOR" edc:vtopval="0x80000000"/>
    <edc:Projection edc:ksegval="0x9D000000" edc:ptovop="XOR" edc:ptovval="0x80000000" edc:vtopop="XOR" edc:vtopval="0x80000000"/>
    <edc:Projection edc:ksegval="0x9F000000" edc:ptovop="XOR" edc:ptovval="0x80000000" edc:vtopop="XOR" edc:vtopval="0x80000000"/>
    <edc:Projection edc:ksegval="0xA0000000" edc:ptovop="XOR" edc:ptovval="0xA0000000" edc:vtopop="XOR" edc:vtopval="0xA0000000"/>
    <edc:Projection edc:ksegval="0xA0000000" edc:ptovop="XOR" edc:ptovval="0xA0000000" edc:vtopop="XOR" edc:vtopval="0xA0000000"/>
    <edc:Projection edc:ksegval="0xA8000000" edc:ptovop="XOR" edc:ptovval="0xA0000000" edc:vtopop="XOR" edc:vtopval="0xA0000000"/>
    <edc:Projection edc:ksegval="0xB0000000" edc:ptovop="XOR" edc:ptovval="0xA0000000" edc:vtopop="XOR" edc:vtopval="0xA0000000"/>
    <edc:Projection edc:ksegval="0xBD000000" edc:ptovop="XOR" edc:ptovval="0xA0000000" edc:vtopop="XOR" edc:vtopval="0xA0000000"/>
    <edc:Projection edc:ksegval="0xBF000000" edc:ptovop="XOR" edc:ptovval="0xA0000000" edc:vtopop="XOR" edc:vtopval="0xA0000000"/>
  </edc:ProjectionTable>
  <edc:PhysicalSpace>
    <edc:NMMRPlace edc:regionid="corenmmrs">
      <edc:SFRDef edc:_modsrc="32xxxx-M14Kec-NMMR.Module" edc:_refcount="1" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="zero" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="zero" edc:nmmrflags="St" edc:nmmrid="0" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000"/>
      <edc:SFRDef edc:_modsrc="32xxxx-M14Kec-NMMR.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="at" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="at" edc:nmmrflags="St" edc:nmmrid="4" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="at" edc:desc="" edc:mask="0xffffffff" edc:name="at" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_modsrc="32xxxx-M14Kec-NMMR.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="v0" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="v0" edc:nmmrflags="SEt" edc:nmmrid="8" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="v0" edc:desc="" edc:mask="0xffffffff" edc:name="v0" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
