Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/1.0.64/edc/PIC32MZ1064DAB288.PIC
      <edc:SFRDef edc:_addr="0x1F822820" edc:_begin="0x0" edc:_end="0x50" edc:_modsrc="DOS-02478_uart_irda_upb_v1_32bit.Module" edc:_refcount="5" edc:access="-----------------------nnnnnnnnn" edc:cname="U5TXREG" edc:desc="" edc:grp="UART1" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----------------------000000000" edc:name="U5TXREG" edc:nzwidth="0x20" edc:por="-----------------------000000000" edc:portals="- - -" ltx:memberofperipheral="UART5 UARTJK">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="U5TXREG" edc:desc="" edc:islanghidden="true" edc:mask="0x1ff" edc:name="U5TXREG" edc:nzwidth="0x9"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F822830" edc:_begin="0x0" edc:_end="0x50" edc:_modsrc="DOS-02478_uart_irda_upb_v1_32bit.Module" edc:_refcount="5" edc:access="-----------------------rrrrrrrrr" edc:cname="U5RXREG" edc:desc="" edc:grp="UART1" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----------------------000000000" edc:name="U5RXREG" edc:nzwidth="0x20" edc:por="-----------------------000000000" edc:portals="- - -" ltx:memberofperipheral="UART5 UARTJK">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="U5RXREG" edc:desc="" edc:islanghidden="true" edc:mask="0x1ff" edc:name="U5RXREG" edc:nzwidth="0x9"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="rp" edc:stimscl="rb" edc:stimtype="Record"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F822840" edc:_begin="0x0" edc:_end="0x50" edc:_modsrc="DOS-02478_uart_irda_upb_v1_32bit.Module" edc:_refcount="5" edc:access="------------nnnnnnnnnnnnnnnnnnnn" edc:cname="U5BRG" edc:desc="" edc:grp="UART1" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------00000000000000000000" edc:name="U5BRG" edc:nzwidth="0x20" edc:por="------------00000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="UART5 UARTJK">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="BRG" edc:desc="" edc:mask="0xfffff" edc:name="BRG" edc:nzwidth="20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F822850" edc:offset="432"/>
      <edc:SFRDef edc:_addr="0x1F822A00" edc:_begin="0x0" edc:_end="0x50" edc:_modsrc="DOS-02478_uart_irda_upb_v1_32bit.Module" edc:_refcount="6" edc:access="--------nn---nnnn-nnnnnnnnnnnnnn" edc:cname="U6MODE" edc:desc="" edc:grp="UART1" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------00---0000000000000000000" edc:name="U6MODE" edc:nzwidth="0x20" edc:por="--------00---0000000000000000000" edc:portals="CLR SET INV" ltx:baseofperipheral="UART6 UARTLM">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="STSEL" edc:desc="" edc:mask="0x1" edc:name="STSEL" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PDSEL" edc:desc="" edc:mask="0x3" edc:name="PDSEL" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="BRGH" edc:desc="" edc:mask="0x1" edc:name="BRGH" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXINV" edc:desc="" edc:mask="0x1" edc:name="RXINV" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ABAUD" edc:desc="" edc:mask="0x1" edc:name="ABAUD" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LPBACK" edc:desc="" edc:mask="0x1" edc:name="LPBACK" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WAKE" edc:desc="" edc:mask="0x1" edc:name="WAKE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UEN" edc:desc="" edc:mask="0x3" edc:name="UEN" edc:nzwidth="0x2"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="RTSMD" edc:desc="" edc:mask="0x1" edc:name="RTSMD" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IREN" edc:desc="" edc:mask="0x1" edc:name="IREN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SIDL" edc:desc="" edc:mask="0x1" edc:name="SIDL" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FRZ" edc:desc="" edc:ishidden="true" edc:islanghidden="true" edc:mask="0x1" edc:name="FRZ" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ON" edc:desc="" edc:mask="0x1" edc:name="ON" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVFDIS" edc:desc="" edc:mask="0x1" edc:name="OVFDIS" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CLKSEL" edc:desc="" edc:mask="0x3" edc:name="CLKSEL" edc:nzwidth="2"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="ACTIVE" edc:desc="" edc:mask="0x1" edc:name="ACTIVE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SLPEN" edc:desc="" edc:mask="0x1" edc:name="SLPEN" edc:nzwidth="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="DS.1">
            <edc:AdjustPoint edc:offset="0x10"/>
            <edc:SFRFieldDef edc:cname="RUNOVF" edc:mask="0x1" edc:name="RUNOVF" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PDSEL0" edc:desc="" edc:mask="0x1" edc:name="PDSEL0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PDSEL1" edc:desc="" edc:mask="0x1" edc:name="PDSEL1" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="UEN0" edc:desc="" edc:mask="0x1" edc:name="UEN0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UEN1" edc:desc="" edc:mask="0x1" edc:name="UEN1" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.1">
            <edc:AdjustPoint edc:offset="0xd"/>
            <edc:SFRFieldDef edc:cname="USIDL" edc:desc="" edc:mask="0x1" edc:name="USIDL" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="UARTEN" edc:desc="" edc:mask="0x1" edc:name="UARTEN" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.2">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        <edc:FreezeBit edc:freezeval="1" edc:name="UART6" edc:pos="14"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F822A10" edc:_begin="0x0" edc:_end="0x50" edc:_modsrc="DOS-02478_uart_irda_upb_v1_32bit.Module" edc:_refcount="6" edc:access="nnnnnnnnnnnnnnnnnnnnnnrrnnnrrrcr" edc:cname="U6STA" edc:desc="" edc:grp="UART1" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000100010000" edc:name="U6STA" edc:nzwidth="0x20" edc:por="00000000000000000000000100010000" edc:portals="CLR SET INV" ltx:memberofperipheral="UART6 UARTLM">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="URXDA" edc:desc="" edc:mask="0x1" edc:name="URXDA" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OERR" edc:desc="" edc:mask="0x1" edc:name="OERR" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FERR" edc:desc="" edc:mask="0x1" edc:name="FERR" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PERR" edc:desc="" edc:mask="0x1" edc:name="PERR" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RIDLE" edc:desc="" edc:mask="0x1" edc:name="RIDLE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ADDEN" edc:desc="" edc:mask="0x1" edc:name="ADDEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="URXISEL" edc:desc="" edc:mask="0x3" edc:name="URXISEL" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="TRMT" edc:desc="" edc:mask="0x1" edc:name="TRMT" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UTXBF" edc:desc="" edc:mask="0x1" edc:name="UTXBF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UTXEN" edc:desc="" edc:mask="0x1" edc:name="UTXEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UTXBRK" edc:desc="" edc:mask="0x1" edc:name="UTXBRK" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="URXEN" edc:desc="" edc:mask="0x1" edc:name="URXEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UTXINV" edc:desc="" edc:mask="0x1" edc:name="UTXINV" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UTXISEL" edc:desc="" edc:mask="0x3" edc:name="UTXISEL" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="ADDR" edc:desc="" edc:mask="0xff" edc:name="ADDR" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="MASK" edc:desc="" edc:mask="0xff" edc:name="MASK" edc:nzwidth="8"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="URXISEL0" edc:desc="" edc:mask="0x1" edc:name="URXISEL0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="URXISEL1" edc:desc="" edc:mask="0x1" edc:name="URXISEL1" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="UTXISEL0" edc:desc="" edc:mask="0x1" edc:name="UTXISEL0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UTXISEL1" edc:desc="" edc:mask="0x1" edc:name="UTXISEL1" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.1">
            <edc:AdjustPoint edc:offset="0xe"/>
            <edc:SFRFieldDef edc:cname="UTXSEL" edc:desc="" edc:mask="0x1" edc:name="UTXSEL" edc:nzwidth="0x2"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.2">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F822A20" edc:_begin="0x0" edc:_end="0x50" edc:_modsrc="DOS-02478_uart_irda_upb_v1_32bit.Module" edc:_refcount="6" edc:access="-----------------------nnnnnnnnn" edc:cname="U6TXREG" edc:desc="" edc:grp="UART1" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----------------------000000000" edc:name="U6TXREG" edc:nzwidth="0x20" edc:por="-----------------------000000000" edc:portals="- - -" ltx:memberofperipheral="UART6 UARTLM">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="U6TXREG" edc:desc="" edc:islanghidden="true" edc:mask="0x1ff" edc:name="U6TXREG" edc:nzwidth="0x9"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F822A30" edc:_begin="0x0" edc:_end="0x50" edc:_modsrc="DOS-02478_uart_irda_upb_v1_32bit.Module" edc:_refcount="6" edc:access="-----------------------rrrrrrrrr" edc:cname="U6RXREG" edc:desc="" edc:grp="UART1" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----------------------000000000" edc:name="U6RXREG" edc:nzwidth="0x20" edc:por="-----------------------000000000" edc:portals="- - -" ltx:memberofperipheral="UART6 UARTLM">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="U6RXREG" edc:desc="" edc:islanghidden="true" edc:mask="0x1ff" edc:name="U6RXREG" edc:nzwidth="0x9"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="rp" edc:stimscl="rb" edc:stimtype="Record"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F822A40" edc:_begin="0x0" edc:_end="0x50" edc:_modsrc="DOS-02478_uart_irda_upb_v1_32bit.Module" edc:_refcount="6" edc:access="------------nnnnnnnnnnnnnnnnnnnn" edc:cname="U6BRG" edc:desc="" edc:grp="UART1" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------00000000000000000000" edc:name="U6BRG" edc:nzwidth="0x20" edc:por="------------00000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="UART6 UARTLM">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="BRG" edc:desc="" edc:mask="0xfffff" edc:name="BRG" edc:nzwidth="20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F822A50" edc:offset="46512"/>
      <edc:SFRDef edc:_addr="0x1F82E000" edc:_begin="0x0" edc:_end="0xa0" edc:_modsrc="DOS-02472_ppi_pmp16_upb_v1.Module" edc:_refcount="1" edc:access="--------n-----n-n-nnnnnnnnnnn-nn" edc:cname="PMCON" edc:desc="" edc:grp="PMP" edc:impl="0xfffeffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------x-----x-00000-0000000-00" edc:name="PMCON" edc:nzwidth="0x20" edc:por="--------x-----x-00000-0000000-00" edc:portals="CLR SET INV" ltx:baseofperipheral="PMP">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RDSP" edc:desc="" edc:mask="0x1" edc:name="RDSP" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WRSP" edc:desc="" edc:mask="0x1" edc:name="WRSP" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CS1P" edc:desc="" edc:mask="0x1" edc:name="CS1P" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CS2P" edc:desc="" edc:mask="0x1" edc:name="CS2P" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ALP" edc:desc="" edc:mask="0x1" edc:name="ALP" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CSF" edc:desc="" edc:mask="0x3" edc:name="CSF" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="PTRDEN" edc:desc="" edc:mask="0x1" edc:name="PTRDEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PTWREN" edc:desc="" edc:mask="0x1" edc:name="PTWREN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PMPTTL" edc:desc="" edc:mask="0x1" edc:name="PMPTTL" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ADRMUX" edc:desc="" edc:mask="0x3" edc:name="ADRMUX" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="SIDL" edc:desc="" edc:mask="0x1" edc:name="SIDL" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FRZ" edc:desc="" edc:ishidden="true" edc:islanghidden="true" edc:mask="0x1" edc:name="FRZ" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ON" edc:desc="" edc:mask="0x1" edc:name="ON" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="DUALBUF" edc:desc="" edc:mask="0x1" edc:name="DUALBUF" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="5"/>
            <edc:SFRFieldDef edc:cname="RDSTART" edc:desc="" edc:mask="0x1" edc:name="RDSTART" edc:nzwidth="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="CSF0" edc:desc="" edc:mask="0x1" edc:name="CSF0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CSF1" edc:desc="" edc:mask="0x1" edc:name="CSF1" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="ADRMUX0" edc:desc="" edc:mask="0x1" edc:name="ADRMUX0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ADRMUX1" edc:desc="" edc:mask="0x1" edc:name="ADRMUX1" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.1">
            <edc:AdjustPoint edc:offset="0xd"/>
            <edc:SFRFieldDef edc:cname="PSIDL" edc:desc="" edc:mask="0x1" edc:name="PSIDL" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PMPEN" edc:desc="" edc:mask="0x1" edc:name="PMPEN" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.2">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:FreezeBit edc:freezeval="1" edc:name="PARALLEL MASTER/SLAVE PORT" edc:pos="14"/>
      </edc:SFRDef>
